# Завдання 1

# num1 = str(input("Введіть перше число :"))
# num2 = str(input("Введіть друге число :"))
# num3 = str(input("Введіть третє число :"))


# sum1 = num1 + num2 + num3

# print(sum1)

# ====================================================================================

# Завдання 3

# meter = float(input("Введіть метри :"))

# centimeters = meter * 100
# decimeters = meter * 10
# millimeters = meter * 1000
# miles = meter / 1609.34

# print(f"{meter} метрів = {centimeters} сантиметрів")
# print(f"{meter} метрів = {decimeters} дециметрів")
# print(f"{meter} метрів = {millimeters} міліметрів")
# print(f"{meter} метрів = {miles} миль")



# ====================================================================================

# basis = int(input("введіть основу :"))

# height = int(input("введіть висоту :"))



# calculation = basis * height / 2

# print(calculation)

# ====================================================================================

# num = input("введіть чотиризначне число :")

# print(f"Перевернуте число: {num[::-1]}")


# ====================================================================================




# ====================================================================================
