# Частина 1
# Завдання 1

# repeat = input("Обчислити ваші числа?  :")
# repeatText = "yes"

# while repeat == repeatText or repeat1 == repeatText1:
    
       
#     num1 = int(input("Введіть перше число :"))
#     num2 = int(input("Введіть друге число :"))
#     num3 = int(input("Введіть третє число :"))


#     multiplication = num1 * num2 * num3

#     addition =num1 + num2 + num3


#     choice = input("виберіть помножити * ,чи додати +,числа вписані вами :")

#     match choice:
#         case "*": print(f"Резутьтат моноження {multiplication}")
#         case "+": print(f"Резутьтат додавання {addition}")
            
#     repeat1 = input("Обчислити ваші числа ще раз?  :")
#     repeatText1 = "yes"
    
        
# =======================================================================================================
        
# Завдання 2
        
# num1 = int(input("Введіть перше число :"))
# num2 = int(input("Введіть друге число :"))
# num3 = int(input("Введіть третє число :"))

# arephmiticNum = (num1 + num2 + num3) / 3

# maxMinNum =[num1,num2,num3]


# choice = input("Як ви бажаєте дізнатись? Максимальне число з ваших: max,мінімальне: min,середнє арефмитичне :arephmitic  :")


# match choice:
#     case "max": print(f"макчимальним число з написаних є {max(maxMinNum)}")
#     case "min": print(f"мінімальним число з написаних є {min(maxMinNum)}")
#     case "arephmitic": print(f"середнє арефмитичне з написаних вами чисел буде {arephmiticNum}")
        
# =======================================================================================================        

# Завдання 3

# meter = int(input("Введіть кількість метрів :"))
# miles = meter * 0.00621371
# inches = meter * 39.37
# yards =  meter * 1.094

# choice = input("виберіть в що ви хочете конвертувати метри,miles милі,inches дюйми,yards ярди :")

# match choice:
#     case "miles": print(f"Кількість метрів в Милях {miles}")
#     case "inches":print(f"Кількість метрів в Дюймах {inches}")
#     case "yards":print(f"Кількість метрів в Ярдах {yards}")
    
    

        
# =======================================================================================================
            
# Частина 2
# Завдання 1

# num = int(input("Введіть номер дня тижня:"))


# match num:
#     case 1:print("1 днем тижня є Понеділок")
#     case 2:print("2 днем тижня є Вівторок")
#     case 3:print("3 днем тижня є Середа")
#     case 4:print("4 днем тижня є Четвер")
#     case 5:print("5 днем тижня є П'ятниця")
#     case 6:print("6 днем тижня є Субота")
#     case 7:print("7 днем тижня є Неділя")



# =======================================================================================================
# Завдання 2
# num = int(input("Введіть номер місяця:"))


# match num:
#     case 1:print("Січень")
#     case 2:print("Лютий")
#     case 3:print("Березень")
#     case 4:print("Квітень")
#     case 5:print("Травень")
#     case 6:print("Червень")
#     case 7:print("Липень")
#     case 8:print("Серпень")
#     case 9:print("Вересень")
#     case 10:print("Жовтень")
#     case 11:print("Листопад")
#     case 12:print("Грудень")


# =======================================================================================================
# Завдання 3
# num = int(input("Введіть число :"))


# if num > 0:
#     print("Number is positive")
# if num < 0:
#     print("Number is negative")
# if num == 0:
#     print("Number is equal to zero")



# =======================================================================================================
# Завдання 4

# =======================================================================================================
# num1 = int(input("Введіть перше число :"))
# num2 = int(input("Введіть друге число :"))

# if num1 == num2:
#     print("Ці числа є рівними")
# else:
#     maxMinNum = [num1,num2]
#     print(max(maxMinNum))
#     print(min(maxMinNum))




# =======================================================================================================


# =======================================================================================================
