# завдання 1
# num1 = int(input("введіть перше чило :"))
# num2 = int(input("введіть друге чило :"))
# num3 = int(input("введіть третє чило :"))


# sum1 = [num1,num2,num3]

# total = sum(sum1)

# print(total)

# =======================================================================================================

# Завдання 2

# salary = int(input("Введіть вашу зарплатню :"))


# credit = int(input("введіть суму місячного платежу за кредитом у банку :"))

# utility_debt = int(input("введіть заборгованість за комунальні послуги :"))



# remainder = salary - credit - utility_debt
# print(f"те що у вас залишилося : {remainder}")

# =======================================================================================================

# завдання 3

# diagonal1 = int(input("введіть першу діагональ :"))
# diagonal2 = int(input("введіть другу діагональ :"))


# sum1 = (diagonal1 * diagonal2) / 2

# print(f"Площа ромба = {sum1} ")


# =======================================================================================================




